org/Renormalization_methods_a_guide_for_beginners_by_McComb_in_2004.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Renormalization_methods_a_guide_for_beginners_by_McComb_in_2004
#+TITLE: Renormalization methods a guide for beginners by McComb in 2004
* [[file:books.org][books]]
* Three sections
** I. What is renormalization
** II. Renormalized perturbation theories
** III. Renormalization group
* I: What is renormalization
** 1. The bedrock problem: why we need renormalization methods
** 2. Easy applications of renormalization group to simple models
** 3. Mean-field theories for simple models
* II: Renormalized perturbation theories
** 4. Perturbation theory using a control parameter
** 5. Classical nonlinear systems driven by random noise
*** 5.1 The generic equation of motion
**** Consider the Navier-Stokes equations, Burgers equation, and Kardar-Parisi-Zhang equation
***** All these equations can be represented as special cases of a generic nonlinear Langevin equation given in Eq. 5.2
**** 5.1.1 The Navier-Stokes equation : NSE
**** 5.1.2 The burgers equation
**** 5.1.3 The KPZ equation
*** 5.2 The moment closure problem
*** 5.3 The pair-correlation tensor
*** 5.4 The zero-order "model" system
*** 5.5 A toy version of the equation of motion
*** 5.6 Perturbation expansion of the toy equation of motion
*** 5.7 Renormalized transport equations for the correlation function
*** 5.8 Reversion of power series
*** 5.9 Formulation in Wyld diagrams
** 6. Application of renormalized perturbation theories to turbulence and related problems
*** 6.1 the real and idealized versions of the turbulence problem
*** 6.2 Two turbulence theories: the DIA and LET equations
*** 6.3 Theoretical results: free decay of turbulence
*** 6.4 Theoretical results: stationary turbulence
*** 6.5 Detailed energy balance in wave number
*** 6.6 Application to other systems
* III: Renormalization group
** 7. Setting the scene: critical phenomena
*** 7.1 Some background material on critical phenomena
*** 7.2 Theoretical models
*** 7.3 Scaling behavior
*** 7.4 Linear response theory
*** 7.5 Serious mean-field theory
*** 7.6 Mean-field critical exponents $$\alpha, \beta, \gamma$$, and $$\delta$$ for the Ising model
*** 7.7 The remaining mean-field critical exponents for the Ising model
*** 7.8 Validity of mean-field theory
*** 7.9 Upper critical dimension
** 8. Real-space renormalization group
*** 8.1 A general statement of the RG transformation
*** 8.2 RG transformation of the Hamiltonian and its fixed points
*** 8.3 Relations between critical exponents from RG
*** 8.4 Applications of the linearized RGT
** 9. Momentum-space renormalization group
*** 9.1 Overview of chapter
*** 9.2 Statistical field theory
*** 9.3 Renormalization group transformation in wave number space
*** 9.4 Scaling dimension: anomalous and normal
*** 9.5 Restatement of our objectives: numerical calculation of the critical exponents
*** 9.6 The Gaussian zero-order model
*** 9.7 Partition function for the Gaussian model
*** 9.8 Correlation functions
*** 9.9 Fixed points for the Gaussian model
*** 9.10 Ginsberg-Landau (GL) theory
** 10. Field-theoretic renormalization group
*** 10.1 Preliminary remarks
*** 10.2 The Ginsburg-Landau model as a quantum field theory
*** 10.3 Infrared and ultraviolet divergences
*** 10.4 Renormalization invariance
*** 10.5 Perturbation theory in x-space
*** 10.6 Perturbation expansion in x-space
*** 10.7 Perturbation expansion in k-space
*** 10.8 The UV divergence and renormalization
*** 10.9 The IR divergence and the epsilon-expansion
*** 10.10 The pictorial significance of Feynman diagrams
** 11. Dynamical renormalization group applied to classical nonlinear systems
*** 11.1 The dynamical RG algorithm
*** 11.2 Application to the Navier-Stokes equation
**** 11.2.1 The RG transformation: the technical problems
**** 11.2.2 Overview of perturbation theory
**** 11.2.3 The application of RG at small wave numbers
**** 11.2.4 The application of RG at large wave numbers
*** 11.3 Application of RG to stirred fluid motion with asymptotic freedom as $$k \rightarrow 0$$
**** 11.3.1 Differential RG equations
**** 11.3.2 Application to other systems
*** 11.4 Relevance of RG to the large-eddy simulation of turbulence
**** 11.4.1 Statement of the problem
**** 11.4.2 Conservation equations for the explicit scales $$k \leq k_c$$
*** 11.5 The conditional average at large wave numbers
**** 11.5.1 The asymptotic conditional average
*** 11.6 Application of RG to turbulence at large wave numbers
**** 11.6.1 perturbative calculation of the conditional average
**** 11.6.2 Truncation of the moment expansion
**** 11.6.3 The RG calculation of the effective viscosity
**** 11.6.4 Recursion relations for the effective viscosity
* IV: Appendices
** A. Statistical ensembles
*** A.1 statistical specification of the N-body assembly
*** A.2 The basic postulates of equilibrium statistical mechanics
*** A.3 Ensemble of assemblies in energy contact
*** A.4 Entropy of an assembly in an ensemble
*** A.5 Principle of maximum entropy
*** A.6 Variational method for the most probably distribution
** B. From statistical mechanics to thermodynamics
*** B.1 The canonical ensmble
**** B.1.1 Identification of the Lagrange multiplier
**** B.1.2 General thermodynamic processes
**** B.1.3 Equilibrium distribution and the bridge equation
*** B.2 Overview and summary
**** B.2.1 The canonical ensemble
** C. Exact solutions in one and two dimensions
*** C.1 The one-dimensional Ising model
*** C.2 Bond percolation in d=2
** D. Quantum treatment of the Hamiltonian N-body assembly
*** D.1 The density matrix $$\rho_{mn}$$
*** D.2 Properties of the density matrix
*** D.3 Density operator for the canonical ensemble
** E. Generalization of the Bogoliubov variational method to a spatially varying magnetic field
