content/posts/Renormalization_methods_a_guide_for_beginners_by_McComb_in_2004.md
+++
title = "Renormalization methods a guide for beginners by McComb in 2004"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:45-04:00
slug = "Renormalization_methods_a_guide_for_beginners_by_McComb_in_2004"
draft = false
+++

## [books]({{< relref "books" >}}) {#books--books-dot-md}


## Three sections {#three-sections}


### I. What is renormalization {#i-dot-what-is-renormalization}


### II. Renormalized perturbation theories {#ii-dot-renormalized-perturbation-theories}


### III. Renormalization group {#iii-dot-renormalization-group}


## I: What is renormalization {#i-what-is-renormalization}


### 1. The bedrock problem: why we need renormalization methods {#1-dot-the-bedrock-problem-why-we-need-renormalization-methods}


### 2. Easy applications of renormalization group to simple models {#2-dot-easy-applications-of-renormalization-group-to-simple-models}


### 3. Mean-field theories for simple models {#3-dot-mean-field-theories-for-simple-models}


## II: Renormalized perturbation theories {#ii-renormalized-perturbation-theories}


### 4. Perturbation theory using a control parameter {#4-dot-perturbation-theory-using-a-control-parameter}


### 5. Classical nonlinear systems driven by random noise {#5-dot-classical-nonlinear-systems-driven-by-random-noise}

<!--list-separator-->

-  5.1 The generic equation of motion

    <!--list-separator-->

    -  Consider the Navier-Stokes equations, Burgers equation, and Kardar-Parisi-Zhang equation

        <!--list-separator-->

        -  All these equations can be represented as special cases of a generic nonlinear Langevin equation given in Eq. 5.2

    <!--list-separator-->

    -  5.1.1 The Navier-Stokes equation : NSE

    <!--list-separator-->

    -  5.1.2 The burgers equation

    <!--list-separator-->

    -  5.1.3 The KPZ equation

<!--list-separator-->

-  5.2 The moment closure problem

<!--list-separator-->

-  5.3 The pair-correlation tensor

<!--list-separator-->

-  5.4 The zero-order "model" system

<!--list-separator-->

-  5.5 A toy version of the equation of motion

<!--list-separator-->

-  5.6 Perturbation expansion of the toy equation of motion

<!--list-separator-->

-  5.7 Renormalized transport equations for the correlation function

<!--list-separator-->

-  5.8 Reversion of power series

<!--list-separator-->

-  5.9 Formulation in Wyld diagrams


### 6. Application of renormalized perturbation theories to turbulence and related problems {#6-dot-application-of-renormalized-perturbation-theories-to-turbulence-and-related-problems}

<!--list-separator-->

-  6.1 the real and idealized versions of the turbulence problem

<!--list-separator-->

-  6.2 Two turbulence theories: the DIA and LET equations

<!--list-separator-->

-  6.3 Theoretical results: free decay of turbulence

<!--list-separator-->

-  6.4 Theoretical results: stationary turbulence

<!--list-separator-->

-  6.5 Detailed energy balance in wave number

<!--list-separator-->

-  6.6 Application to other systems


## III: Renormalization group {#iii-renormalization-group}


### 7. Setting the scene: critical phenomena {#7-dot-setting-the-scene-critical-phenomena}

<!--list-separator-->

-  7.1 Some background material on critical phenomena

<!--list-separator-->

-  7.2 Theoretical models

<!--list-separator-->

-  7.3 Scaling behavior

<!--list-separator-->

-  7.4 Linear response theory

<!--list-separator-->

-  7.5 Serious mean-field theory

<!--list-separator-->

-  7.6 Mean-field critical exponents \\[\alpha, \beta, \gamma\\], and \\[\delta\\] for the Ising model

<!--list-separator-->

-  7.7 The remaining mean-field critical exponents for the Ising model

<!--list-separator-->

-  7.8 Validity of mean-field theory

<!--list-separator-->

-  7.9 Upper critical dimension


### 8. Real-space renormalization group {#8-dot-real-space-renormalization-group}

<!--list-separator-->

-  8.1 A general statement of the RG transformation

<!--list-separator-->

-  8.2 RG transformation of the Hamiltonian and its fixed points

<!--list-separator-->

-  8.3 Relations between critical exponents from RG

<!--list-separator-->

-  8.4 Applications of the linearized RGT


### 9. Momentum-space renormalization group {#9-dot-momentum-space-renormalization-group}

<!--list-separator-->

-  9.1 Overview of chapter

<!--list-separator-->

-  9.2 Statistical field theory

<!--list-separator-->

-  9.3 Renormalization group transformation in wave number space

<!--list-separator-->

-  9.4 Scaling dimension: anomalous and normal

<!--list-separator-->

-  9.5 Restatement of our objectives: numerical calculation of the critical exponents

<!--list-separator-->

-  9.6 The Gaussian zero-order model

<!--list-separator-->

-  9.7 Partition function for the Gaussian model

<!--list-separator-->

-  9.8 Correlation functions

<!--list-separator-->

-  9.9 Fixed points for the Gaussian model

<!--list-separator-->

-  9.10 Ginsberg-Landau (GL) theory


### 10. Field-theoretic renormalization group {#10-dot-field-theoretic-renormalization-group}

<!--list-separator-->

-  10.1 Preliminary remarks

<!--list-separator-->

-  10.2 The Ginsburg-Landau model as a quantum field theory

<!--list-separator-->

-  10.3 Infrared and ultraviolet divergences

<!--list-separator-->

-  10.4 Renormalization invariance

<!--list-separator-->

-  10.5 Perturbation theory in x-space

<!--list-separator-->

-  10.6 Perturbation expansion in x-space

<!--list-separator-->

-  10.7 Perturbation expansion in k-space

<!--list-separator-->

-  10.8 The UV divergence and renormalization

<!--list-separator-->

-  10.9 The IR divergence and the epsilon-expansion

<!--list-separator-->

-  10.10 The pictorial significance of Feynman diagrams


### 11. Dynamical renormalization group applied to classical nonlinear systems {#11-dot-dynamical-renormalization-group-applied-to-classical-nonlinear-systems}

<!--list-separator-->

-  11.1 The dynamical RG algorithm

<!--list-separator-->

-  11.2 Application to the Navier-Stokes equation

    <!--list-separator-->

    -  11.2.1 The RG transformation: the technical problems

    <!--list-separator-->

    -  11.2.2 Overview of perturbation theory

    <!--list-separator-->

    -  11.2.3 The application of RG at small wave numbers

    <!--list-separator-->

    -  11.2.4 The application of RG at large wave numbers

<!--list-separator-->

-  11.3 Application of RG to stirred fluid motion with asymptotic freedom as \\[k \rightarrow 0\\]

    <!--list-separator-->

    -  11.3.1 Differential RG equations

    <!--list-separator-->

    -  11.3.2 Application to other systems

<!--list-separator-->

-  11.4 Relevance of RG to the large-eddy simulation of turbulence

    <!--list-separator-->

    -  11.4.1 Statement of the problem

    <!--list-separator-->

    -  11.4.2 Conservation equations for the explicit scales \\[k \leq k\_c\\]

<!--list-separator-->

-  11.5 The conditional average at large wave numbers

    <!--list-separator-->

    -  11.5.1 The asymptotic conditional average

<!--list-separator-->

-  11.6 Application of RG to turbulence at large wave numbers

    <!--list-separator-->

    -  11.6.1 perturbative calculation of the conditional average

    <!--list-separator-->

    -  11.6.2 Truncation of the moment expansion

    <!--list-separator-->

    -  11.6.3 The RG calculation of the effective viscosity

    <!--list-separator-->

    -  11.6.4 Recursion relations for the effective viscosity


## IV: Appendices {#iv-appendices}


### A. Statistical ensembles {#a-dot-statistical-ensembles}

<!--list-separator-->

-  A.1 statistical specification of the N-body assembly

<!--list-separator-->

-  A.2 The basic postulates of equilibrium statistical mechanics

<!--list-separator-->

-  A.3 Ensemble of assemblies in energy contact

<!--list-separator-->

-  A.4 Entropy of an assembly in an ensemble

<!--list-separator-->

-  A.5 Principle of maximum entropy

<!--list-separator-->

-  A.6 Variational method for the most probably distribution


### B. From statistical mechanics to thermodynamics {#b-dot-from-statistical-mechanics-to-thermodynamics}

<!--list-separator-->

-  B.1 The canonical ensmble

    <!--list-separator-->

    -  B.1.1 Identification of the Lagrange multiplier

    <!--list-separator-->

    -  B.1.2 General thermodynamic processes

    <!--list-separator-->

    -  B.1.3 Equilibrium distribution and the bridge equation

<!--list-separator-->

-  B.2 Overview and summary

    <!--list-separator-->

    -  B.2.1 The canonical ensemble


### C. Exact solutions in one and two dimensions {#c-dot-exact-solutions-in-one-and-two-dimensions}

<!--list-separator-->

-  C.1 The one-dimensional Ising model

<!--list-separator-->

-  C.2 Bond percolation in d=2


### D. Quantum treatment of the Hamiltonian N-body assembly {#d-dot-quantum-treatment-of-the-hamiltonian-n-body-assembly}

<!--list-separator-->

-  D.1 The density matrix \\[\rho\_{mn}\\]

<!--list-separator-->

-  D.2 Properties of the density matrix

<!--list-separator-->

-  D.3 Density operator for the canonical ensemble


### E. Generalization of the Bogoliubov variational method to a spatially varying magnetic field {#e-dot-generalization-of-the-bogoliubov-variational-method-to-a-spatially-varying-magnetic-field}
